hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/cla.h
    HWREGH(base + CLA_O_MVECTBGRND) = (uint16_t)claTaskAddr;

    EDIS;
}
#endif // #ifdef __TMS320C28XX__

 // These functions are accessible only from the CLA (Type - 1/2)
#if defined(__TMS320C28XX_CLA1__) || defined(__TMS320C28XX_CLA2__)
//*****************************************************************************
//
//! Enable the Software Interrupt for a given CLA Task
//!
//! \param base is the base address of the CLA controller.
//! \param taskFlags is the bitwise OR of the tasks for which software
//! interrupts are to be enabled, CLA_TASKFLAG_N where N is the task number 
//! from 1 to 8, or CLA_TASKFLAG_ALL to enable software interrupts of all tasks
//!
//! This function enables the  Software Interrupt for a single, or set of, CLA 
//! task(s). It does this by writing a 1 to the task's bit in the 
//! CLA1SOFTINTEN register. By setting a task's SOFTINT bit, you disable its
//! ability to generate an end-of-task interrupt
//! For example, if we enable Task 2's SOFTINT bit, we disable its ability to
//! generate an end-of-task interrupt, but now any running CLA task has the 
//! ability to force task 2's interrupt (through the CLA1INTFRC register) to 
//! the main CPU. This interrupt will be handled by the End-of-Task 2 interrupt
//! handler even though the interrupt was not caused by Task 2 running to 
//! completion. This allows programmers to generate interrupts while a control 
//! task is running.
//! 
//! \note 
//! -# The CLA1SOFTINTEN and CLA1INTFRC are only writable from the CLA.
//! -# Enabling a given task's software interrupt enable bit disables that 
//! task's ability to generate an End-of-Task interrupt to the main CPU, 
//! however, should another task force its interrupt (through the CLA1INTFRC
//! register), it will be handled by that task's End-of-Task Interrupt Handler.
//! 
//! \return None.
//
//*****************************************************************************
static inline void 
CLA_enableSoftwareInterrupt(uint32_t base, uint16_t taskFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(CLA_isBaseValid(base));

    //
    // Modify protected register
    //
    __meallow();

    //
    // Enable Software Interrupt
    //
    HWREGH(base + CLA_O_SOFTINTEN) |= taskFlags;

    __medis();
}

//*****************************************************************************
//
//! Disable the Software Interrupt for a given CLA Task
//!
//! \param base is the base address of the CLA controller.
//! \param taskFlags is the bitwise OR of the tasks for which software
//! interrupts are to be disabled, CLA_TASKFLAG_N where N is the task number 
//! from 1 to 8, or CLA_TASKFLAG_ALL to disable software interrupts of all 
//! tasks
//!
//! This function disables the  Software Interrupt for a single, or set of, CLA 
//! task(s). It does this by writing a 0 to the task's bit in the 
//! CLA1SOFTINTEN register. 
//!
//! \note 
//! -# The CLA1SOFTINTEN and CLA1INTFRC are only writable from the CLA.
//! -# Disabling a given task's software interrupt ability allows that 
//! task to generate an End-of-Task interrupt to the main CPU.
//! 
//! \return None.
//
//*****************************************************************************
static inline void 
CLA_disableSoftwareInterrupt(uint32_t base, uint16_t taskFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(CLA_isBaseValid(base));

    //
    // Modify protected register
    //
    __meallow();

    //
    // Enable Software Interrupt
    //
    HWREGH(base + CLA_O_SOFTINTEN) &=  ~taskFlags;

    __medis();
}
//*****************************************************************************
//
//! Force a particular Task's Software Interrupt
//!
//! \param base is the base address of the CLA controller.
//! \param taskFlags is the bitwise OR of the task's whose software
//! interrupts are to be forced, CLA_TASKFLAG_N where N is the task number 
//! from 1 to 8, or CLA_TASKFLAG_ALL to force software interrupts for all tasks
//!
//! This function forces the  Software Interrupt for a single, or set of, CLA 
//! task(s). It does this by writing a 1 to the task's bit in the 
//! CLA1INTFRC register. 
//! For example, if we enable Task 2's SOFTINT bit, we disable its ability to
//! generate an end-of-task interrupt, but now any running CLA task has the 
//! ability to force task 2's interrupt (through the CLA1INTFRC register) to 
//! the main CPU. This interrupt will be handled by the End-of-Task 2 interrupt
//! handler even though the interrupt was not caused by Task 2 running to 
//! completion. This allows programmers to generate interrupts while a control 
//! task is running.
//! 
//! \note 
//! -# The CLA1SOFTINTEN and CLA1INTFRC are only writable from the CLA.
//! -# Enabling a given task's software interrupt enable bit disables that 
//! task's ability to generate an End-of-Task interrupt to the main CPU, 
//! however, should another task force its interrupt (through the CLA1INTFRC
//! register), it will be handled by that task's End-of-Task Interrupt Handler.
//! -# This function will set the INTFRC bit for a task, but does not check
//! that its SOFTINT bit is set. It falls to the user to ensure that software
//! interrupt for a given task is enabled before it can be forced.
//! 
//! \return None.
//
//*****************************************************************************
static inline void 
CLA_forceSoftwareInterrupt(uint32_t base, uint16_t taskFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(CLA_isBaseValid(base));

    //
    // Modify protected register
    //
    __meallow();

    //
    // Force Software Interrupt
    //
    HWREGH(base + CLA_O_SOFTINTFRC) |= taskFlags;

    __medis();
}

#endif // #if defined(__TMS320C28XX_CLA1__) || defined(__TMS320C28XX_CLA2__)

// These functions can only be called from the C28x
#ifdef __TMS320C28XX__
//*****************************************************************************
//
//! Registers an End-of-Task interrupt handler
//!
//! \param base is the base address of the CLA controller.
//! \param taskNumber is the the bitwise OR of the task CLA_TASK_N where N is 
//! a number from 1 to 8.
//! \param handler is a pointer to the function to be called when the
//! CLA End-of-Taskn (n = 1 to 8) interrupt occurs.
//!
//! Each CLA Task can trigger an interrupt to the ePIE when it completes 
//! execution. This function registers the handler to be called when an 
//! CLA End-of-Task interrupt occurs.  This function enables the global 
//! interrupt in the interrupt controller for a particular task, 
//! CLA_TASK_N (N = 1 to 8)
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_registerEndOfTaskInterrupt(uint32_t base, CLA_TaskNumber taskNumber, 
                               void (*handler)(void));

//*****************************************************************************
//
//! Unregisters an End-of-Task interrupt handler
//!
//! \param base is the base address of the CLA controller.
//! \param taskNumber is the the bitwise OR of the task CLA_TASK_N where N is 
//! a number from 1 to 8.
//!
//! This function clears the handler of the CLA End-of-Taskn (n = 1 to 8) 
//! interrupt.  This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler is no longer called.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_unregisterEndOfTaskInterrupt(uint32_t base, CLA_TaskNumber taskNumber);

//*****************************************************************************
//
//! Registers an Overflow (Math) interrupt handler
//!
//! \param base is the base address of the CLA controller.
//! \param handler is a pointer to the function to be called when the
//! CLA LUF (Overflow from a Math Operation) interrupt occurs.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_registerLUFInterrupt(uint32_t base, void (*handler)(void));

//*****************************************************************************
//
//! Unregisters an Overflow (Math) interrupt handler
//!
//! \param base is the base address of the CLA controller.
//!
//! This function clears the handler of the CLA LUF interrupt. This function 
//! also masks off the interrupt in the interrupt controller so that the 
//! interrupt handler is no longer called.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_unregisterLUFInterrupt(uint32_t base);

//*****************************************************************************
//
//! Registers an Underflow (Math) interrupt handler
//!
//! \param base is the base address of the CLA controller.
//! \param handler is a pointer to the function to be called when the
//! CLA LVF (Underflow from a Math Operation) interrupt occurs.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_registerLVFInterrupt(uint32_t base, void (*handler)(void));

//*****************************************************************************
//
//! Unregisters an Underflow (Math) interrupt handler
//!
//! \param base is the base address of the CLA controller.
//!
//! This function clears the handler of the CLA LVF interrupt. This function 
//! also masks off the interrupt in the interrupt controller so that the 
//! interrupt handler is no longer called.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
CLA_unregisterLVFInterrupt(uint32_t base);

//*****************************************************************************
//
//! Get Status register for the back ground task.
//!
//! \param base is the base address of the CLA controller.
//! \param stsFlag is status item to be returned.
//!
//! The value of \e stsFlag can be any of the following:
//! - \b CLA_BGSTS_RUNNING
//! - \b CLA_BGSTS_CANNOT_INTERRUPT
//! - \b CLA_BGSTS_OVERFLOW
//!
//! This function gets the status of background task
//!
//! \return Based on the value of \e stsFlag, the function will return:
//! - \b CLA_BGSTS_RUNNING - The function will return \b true if the background
//!   task is running.
//! - \b CLA_BGSTS_CANNOT_INTERRUPT - The function will return \b true if the
//!   background task will not be interrupted (when MSETC BGINTM is executed).
//! - \b CLA_BGSTS_OVERFLOW - This function will return \b true if an enabled
//!   hardware trigger occurred while _MCTLBGRND.BGSTART is set.
//
//*****************************************************************************
extern bool 
CLA_getBackgroundTaskStatus(uint32_t base, CLA_BGTaskStatus stsFlag);

//*****************************************************************************
//
//! Configures CLA task triggers.
//!
//! \param taskNumber is the number of the task CLA_TASK_N where N is a number
//! from 1 to 8.
//! \param trigger is the trigger source to be assigned to the selected task.
//!
//! This function configures the trigger source of a CLA task. The
//! \e taskNumber parameter indicates which task is being configured, and the
//! \e trigger parameter is the interrupt source from a specific peripheral
//! interrupt (or software) that will trigger the task.
//!
//! \return None.
//
//*****************************************************************************
extern void 
CLA_setTriggerSource(CLA_TaskNumber taskNumber, CLA_Trigger trigger);

#endif //#ifdef __TMS320C28XX__
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************                                 
                                 
//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif //  CLA_H
